{
    "kursevi": {
        "11111111111": {
            "id": 11111111111,
            "naziv": "Angular za početnike",
            "autor": "Zoran Petrovic",
            "datumIzmene": "2021-11-12",
            "opis": "Angular je najstariji, a ujedno najmoćniji i najkompleksniji softverski okvir koji je namenjen frontend programiranju. Angular je aplikativni softverski okvir (engl. framework) namenjen kreiranju klijentskog dela web aplikacija. Angular je razvila kompanija Google; prvi put je objavljen 2010. godine. Angular u svom sklopu objedinjuje sve alate neophodne za kreiranje kompleksnih, velikih web aplikacija na brz i jednostavan način. Na kursu „Angular for Beginners“, uz kontinuiran praktični rad, naučiti ćemo osnove arhikteture, alata i strukture platforme Angular kompanije Google, za razvoj dinamičkih web aplikacija i stranica, osnove HTML-a, CSS-a i BootStrap CSS biblioteke za dizajniranje konačnog izgleda aplikacije, kao i osnove RESTful API platforme za preuzimanje podataka koji se prezentuju na stranici ili aplikaciji. Kao zadnji korak, razvijenu aplikaciju ćemo „postaviti“ na internet. Iako je Angular veoma kompleksan alat, i iako mnoge prethodno pomenute teme i termini zvuče nerazumljivo i komplikovano, na ovom kursu ćemo se fokusirati na najvažnije stvari uz što jednostavnija objašnjenja kako bi polaznicima približili i omogućili da razumiju glavne koncepte u izradi web aplikacija. Kurs je predviđen za osobe sa osnovnim znanjem o programiranju, ali i za početnike koji žele da se upuste u avanturu zvanu Angular. Sve što je potrebno učesnicima kursa je volja i pozitivan stav, a njihovo znanje će se nadograđivati iz modula u modul.",
            "slika": "https://i.imgur.com/aYCw56T.png",
            "cena": 9999,
            "brojLekcija": 11,
            "kategorija": "Web programiranje",
            "jezik": "Engleski",
            "prosecnaOcena": 4.97,
            "brojKorisnika": 1231,
            "sertifikovan": "da"
        },
        "11111111112": {
            "id": 11111111112,
            "naziv": "Osnove HTML-a i CSS-a za 2h",
            "autor": "Petar Petrovic",
            "datumIzmene": "2021-10-22",
            "opis": "HTML odnosno HyperText Markup Language je opisni jezik pomoću koga se kreiraju sajtovi, tačnije funkcionalnost elemenata jedne web stranice. S druge strane, CSS (Cascading Style Sheets) predstavlja jezik koji se koristi za uređivanje samog izgleda i formatiranje svih elemenata koje vidimo na sajtu. Iako na prvi pogled možda deluje da HTML i CSS zapravo imaju istu funkciju, njihova namena je potpuno drugačija, što je doprinelo tome da se ova dva jezika idealno dopunjuju. Tokom ovog HTML i CSS kursa, koji možete pohađati kao online kurs ili tradicionalno – u učionici, a koji je deo pripadajućih programa, upoznaćete se sa svim potrebnim detaljima za rad u pomenutim jezicima, počevši od najosnovnijih pojmova koji će vam pomoći da steknete kompletnu sliku o HTML-u i CSS-u. Razumevanjem ovih jezika naučićete kako funkcioniše web i steći informatičku pismenost koja spada među najtraženija znanja 21. veka. Kada ovladate HTML-om i CSS-om, bićete u mogućnosti da kreirate web aplikacije, ili da kroz kod prilagođavate i održavate sadržaj na već formiranim sajtovima. Pored toga, moći ćete da uređujete web stranice pravljene u WordPressu, da stilizujete marketinške mejlove i još mnogo toga.",
            "slika": "https://i.imgur.com/IfoRpDP.png",
            "cena": 8650,
            "brojLekcija": 8,
            "kategorija": "Web programiranje",
            "jezik": "Srpski",
            "prosecnaOcena": 4.83,
            "brojKorisnika": 1831,
            "sertifikovan": "da"
        },
        "11111111113": {
            "id": 11111111113,
            "naziv": "JavaScript Development",
            "autor": "Novak Novakovic",
            "datumIzmene": "2021-09-02",
            "opis": "JavaScript je trenutno programski jezik broj 1. na internetu po statistici više izvora. Čak 95% veb sajtova kosristi JS. JavaScript je upotrebljiv ne samo u front-end razvoju, već se može koristiti i za backend, zahvaljujući Node.js – suludo brzom serverskom okruženju, pa čak je upotrebljen za neke desktop aplikacije. JavaScript je dinamičan i zanimljiv za rad. Ali je pre svega programski jezik. Potrebno je da ga učiš posvećeno, od samih osnova. Zato je kurs osmišljen tako da prvo naučiš najjednostavniju verziju ovog jezika – Vanilla JavaScript.Ova verzija je baš kao ukus vanile – blaga i bez „zaslađivača“. To je standardan JavaScript jezik koji nema dodatne resurse i funckije. Baš zato je odličan za tebe kao početnika. Omogućava ti da shvatiš način funkcionisanja programskog jezika, tako da možeš samostalno da kreiraš dinamična rešenja. Takođe, kada savladaš Vanilla JavaScript znaćeš da prepoznaš i otkloniš greške u samom kodu – onom delu programiranja koji korisnik ne vidi.",
            "slika": "https://i.imgur.com/WjBihYR.jpg",
            "cena": 7235,
            "brojLekcija": 17,
            "kategorija": "Web programiranje",
            "jezik": "Engleski",
            "prosecnaOcena": 4.53,
            "brojKorisnika": 530,
            "sertifikovan": "ne"
        },
        "11111111114": {
            "id": 11111111114,
            "naziv": "Objektno orijentisano programiranje u C#",
            "autor": "Jovana Jovanovic",
            "datumIzmene": "2021-09-02",
            "opis": "Kao što mu samo ime govori, objektno orijentisano programiranje zasniva se na konceptu objekata. Reč je o pristupu koji omogućava rešavanje problema međusobnom saradnjom objekata unutar programa.Ovaj online kurs programiranja je upravo za tebe ukoliko želiš da: stekneš znanje iz objektno orijentisanog programiranja – jedno od najvažnijih koncepata za programere, naučiš kako da povećaš fleksibilnost programa uz lakše održavanje, jasno razumeš rad programa – podaci i njihovo ponašanje (metode) su spojeni u formi objekta što značajno olakšava razumevanje, brzo napreduješ zahvaljujući iskusnim predavačima i pažljivo pripremljenom materijalu uz obilje raznovrsnih ilustracija.",
            "slika": "https://i.imgur.com/rG1aU9n.png",
            "cena": 7235,
            "brojLekcija": 12,
            "kategorija": "Objektno programiranje",
            "jezik": "Engleski",
            "prosecnaOcena": 4.88,
            "brojKorisnika": 1126,
            "sertifikovan": "da"
        },
        "11111111115": {
            "id": 11111111115,
            "naziv": "Python OOP",
            "autor": "Ivana Ivanovic",
            "datumIzmene": "2021-08-19",
            "opis": "Kurs Python OOP objašnjava zašto je dobro programirati objektno i kreirati i koristiti klase, kao i koji su njeni članovi, koja je razlika između polja klase i njenih metoda i šta oba pojma predstavljaju, šta se podrazumeva pod instanciranjem jedne klase, odnosno pravljenjem njenih objekata. Objektno programiranje, kao najzastupljeniji oblik programiranja danas, prisutno je i veoma korišćeno i u Python programiranju, pa se tokom ovog kursa ono detaljno proučava u kontekstu ovog jezika. Kroz kurs obnavljaju se svi prethodno naučeni gradivni blokovi i dopunjuju novim, objektno orijentisanim programskim elementima. Detaljno je objašnjen koncept kompozicije podataka u objekte. Razjašnjava se pojam klase u objektnom programiranju, njenih komponenti, načina na koje se može koristiti – kao samostalna jedinica sistema ili kao šablon za kreiranje različitih objekata.Takođe se obrađuju i napredne tehnike u objektnom programiranju, predstavlja se koncept nasleđivanja, prave se kompleksne hijerarhijske objektne strukture, vrši prepisivanje i preopterećenje metoda, a različitim članovima klase dopušta ili zabranjuje upotreba kontrolom pristupa. ",
            "slika": "https://i.imgur.com/kKM1wzE.png",
            "cena": 9455,
            "brojLekcija": 23,
            "kategorija": "Objektno programiranje",
            "jezik": "Engleski",
            "prosecnaOcena": 4.66,
            "brojKorisnika": 1356,
            "sertifikovan": "da"
        },
        "11111111116": {
            "id": 11111111116,
            "naziv": "Uvod u Javu i Objektno orijentisano programiranje",
            "autor": "Sava Savic",
            "datumIzmene": "2020-07-19",
            "opis": "Želite da postanete programer, ne znate odakle da krenete? Mi znamo! Poznavanje Java programskog jezika vaša je polazna stanica za ulazak u svet programiranja. Osnovni kurs koji pružamo našim polaznicima, za cilj ima upoznavanje sa osnovama objektno orijentisanog programiranja, korišćenjem programskog jezika Java. Objektno orijentisano programiranje je koncept programiranja koji je najbliži realnom svetu, nivou razmišljanja i rešavanja problema u svakodnevnom životu.Ukoliko želite da učite Javu, predstavljamo vam naš kurs Osnove programiranja – Java. Kurs je prilagođen početnicima i nije neophodno nikakvo predznanje za pohađanje nastave jer je kurs osmišljen tako da se sa učenjem kreće od samih osnova. Osnovni kurs koji pružamo našim polaznicima, za cilj ima upoznavanje sa osnovama objektno orijentisanog programiranja, korišćenjem programskog jezika Java. Objektno orijentisano programiranje je koncept programiranja koji je najbliži realnom svetu, nivou razmišljanja i rešavanja problema u svakodnevnom životu.Kroz mnoštvo primera polaznici će naučiti šta su objekti i klase kao i osnovne koncepte objektno-orijentisanog programiranja (nasleđivanje, učaurenje i polimorfizam). Koncept apstrakcije u Javi biće objašnjen pomoću apstraktnih klasa i interfejsa. Čuvanje podataka u operativnoj memoriji biće objašnjeno preko nizova i kolekcija, dok će čuvanje podataka na spoljnoj memoriji biće objašnjeno u radu sa datotekama.",
            "slika": "https://i.imgur.com/9Rq1ZWl.png",
            "cena": 10995,
            "brojLekcija": 27,
            "kategorija": "Objektno programiranje",
            "jezik": "Engleski",
            "prosecnaOcena": 4.79,
            "brojKorisnika": 1559,
            "sertifikovan": "da"
        },
        "11111111117": {
            "id": 11111111117,
            "naziv": "Uvod u algoritme",
            "autor": "Ivan Ivanovic",
            "datumIzmene": "2020-07-19",
            "opis": "Kurs Uvod u algoritme pokriva široki spektar algoritama i tehnika programiranja. Cilj kursa je upoznavanje sa najvažnijim algoritmima koji se koriste za rešavanje praktičnih problema koji se javljaju u računarskim naukama. Sadržaj kursa obuhvata osvrt na strukture podataka, matematičke algoritme, rekurziju i backtrack, teoriju grafova, dinamičko programiranje, geometrijske algoritme... Online kurseva sa sličnim sadržajem ima dosta, tako da je fer pitanje: zašto se ovaj kurs razlikuje od drugih? Tri ključne stvari koje ovaj konkretan kurs izdvajaju su: struktura, scenario i tematika.Struktura. Struktura i organizacija kursa je defisana tako da bude jednostavna i prilagođena potrebama svakog korisnika. Akcenat je stavljen na video materijale koje je lakše pratiti od čitanja pisanog materijala.  Imaćete dosta statistika svog progresa, biće vam ukazane i objašnjene greške, kao i mogući dodatni materijal ukoliko je to potrebno. Pored same teorijske priče kurs zahteva i implementaciju prezentovanih algoritama, kao i teorijsko testiranje.Scenario. Sam sadržaj kursa je definisan tako da pokriva dosta scenarija, od koji izdvajamo tri glavna:Kurs pokriva potrebno znanje za nacionalna takmičenja iz programiranja za učenike srednjih škola, kao i za internacionalna takmičenja IOI i ACM. Kurs prati sadržaj kurseva dizajna i analize algoritama. Kurs pokriva potrebno znanje iz algoritama za većinu softverskih firmi.Tematika. Pored samog izlaganja konkretnog algoritma, materijali pokrivaju i dosta propratnih napomena vezanih za isti: najbolji pristup implementaciji, testiranje, analizu složenosti, “trikove” i uopštenja... Pričaćemo o standardnim greškama, kako u implementaciji tako i u teoriji, i iste dopunjavati analizom vaših rešenja. Svaki primer će biti detaljno objašnjen i rešenje će biti prikazano kroz proces razvijanja ideje, a ne samo navedeno kao grom iz vedra neba. Nadamo se da ćemo u što više situacija pitanje “kako da mi ovo padne na pamet” zameniti pitanjem “kako mi ovo nije palo na pamet”.",
            "slika": "https://i.imgur.com/7ZvZAmi.jpg",
            "cena": 9995,
            "brojLekcija": 15,
            "kategorija": "Algoritmi",
            "jezik": "Srpski",
            "prosecnaOcena": 4.65,
            "brojKorisnika": 829,
            "sertifikovan": "ne"
        },
        "11111111118": {
            "id": 11111111118,
            "naziv": "Algoritmi za sortiranje",
            "autor": "Jovan Jovanovic",
            "datumIzmene": "2021-02-10",
            "opis": "Sortiranje ili ređanje je jedan od fundamentalnih zadataka u računarstvu. Sortiranje podrazumeva linearno uređivanje niza po datom kriteriju (npr. niza brojeva po veličini, niza teksta leksikografski ili po dužini, niza struktura na osnovu vrednosti nekog polja i slično). U okviru ovog kursa upoznaćemo se sa različitim tipovima algoritama sortiranja, kako onima koji sortiraju u mestu ( eng. in place), tako i sa onima koji zahtevaju dodntni niz ili pomoćnu strukturu. Biće reči o performansama svakog od algoritama, složenosti, memorijskim zahtevima i slično. Algoritmi koji će biti obrađeni su: Bubble sort, Selection sort, Insertion sort, Merge sort, Quicksort, Shell sort, te Heap sort.",
            "slika": "https://i.imgur.com/LMmLPWm.jpg",
            "cena": 9125,
            "brojLekcija": 9,
            "kategorija": "Algoritmi",
            "jezik": "Srpski",
            "prosecnaOcena": 4.81,
            "brojKorisnika": 876,
            "sertifikovan": "ne"
        },
        "11111111119": {
            "id": 11111111119,
            "naziv": "Strukture podataka od osnovnih do naprednih",
            "autor": "Tomislav Tomic",
            "datumIzmene": "2019-12-10",
            "opis": "Strukture podataka su jedan od osnovnih sastojaka u receptu za kreiranje efikasnih algoritama i dobrog dizajna softvera. Znanje o tome kako da se kreiraju i dizajniraju dobre strukture podataka neophodno je da biste postali primeran programer. Ovaj kurs će vas naučiti kako da savladate fundamentalne ideje koje su u osnovama struktura podataka. Naučite i savladajte najčešće strukture podataka u ovom sveobuhvatnom kursu, a to su: statički i dinamički nizovi, jednostruko i dvostruko spregnute liste, stekovi, redovi, redovi prioriteta, heap-ovi, binarna stabla/stabla binarne pretrage, heš tabele, AVL stabla, te binarna indeksirana stabla.Ovaj kurs vam pruža visokokvalitetne animirane video zapise koji objašnjavaju mnoštvo struktura podataka i kako su one vizuelno predstavljene. Naučićete kako da koristite i pravite različite strukture podataka uz jednostavna uputstva korak po korak. Svaka predstavljena struktura podataka biće praćena nekim radnim izvornim kodom (u Javi) kako bi se učvrstilo vaše razumevanje iste. Takođe na kraju kursa imaćete da odradite i nekoliko zadataka i kviz sa pitanja sa višestrukim izborom kako biste samostalnoprimenili stečeno znanje.",
            "slika": "https://i.imgur.com/lmVcFhi.jpg",
            "cena": 9399,
            "brojLekcija": 13,
            "kategorija": "Strukture podataka",
            "jezik": "Srpski",
            "prosecnaOcena": 4.36,
            "brojKorisnika": 1002,
            "sertifikovan": "ne"
        },
        "11111111110": {
            "id": 11111111110,
            "naziv": "Strukture podataka A-Z ",
            "autor": "Nikola Nikolic",
            "datumIzmene": "2021-04-15",
            "opis": "Čestitam! Pronašli ste najpopularniji, najkompletniji i najažurniji resurs na mreži za učenje struktura podataka. Da li želite da se preipremite za sledeći intervju za kodiranje? Da li želite da budete majstor u rešavanju izazovnih algoritama? Da li ste zainteresovani za oblast struktura podataka? Da li ste zainteresovani da se igrate sa složenim algoritmima? Onda je ovaj kurs za vas! Morate razumeti algoritme i strukture podataka jer sam video kod koji su napisali ljudi koji nisu razumeli strukture podataka i algoritme; i verujte mi, ne želite da budete jedni od njih. Ceo kurs se zasniva oko jednog cilja: da vas pretvori u profesionalnog programera i da budete sposobni da pišete kod kao profesionalac. Da li se plašite intervjua za kodiranje? Pridružite mi se u ovoj avanturi, razbijte svoj intervju za kodiranje tako što ćete savladati strukture podataka i algoritme. Postoji mnogo besplatnih tutorijala i video snimaka na YouTube-u. Zašto biste želeli da pohađate ovaj kurs? Odgovor je jednostavan: kvalitet nastave. Dakle, od samog početka do samog kraja, bićete sigurni da ćete biti u dobrim rukama i da ćete ispratiti svaki minut kursa, za razliku od čitanja mnogih besplatnih tutorijala i video zapisa, ne gubite svoje dragoceno vreme. Svaki odeljak je opremljen uravnoteženom mešavinom teorije i implementacije.",
            "slika": "https://i.imgur.com/jZAuXdx.jpg",
            "cena": 11225,
            "brojLekcija": 27,
            "kategorija": "Strukture podataka",
            "jezik": "Engleski",
            "prosecnaOcena": 4.61,
            "brojKorisnika": 651,
            "sertifikovan": "da"
        }
    },
    "korisnici": {
        "-MNQo55Aw0tLdwahMZMK": {
            "id": "-MNQo55Aw0tLdwahMZMK",
            "adresa": "Gogoljeva 39, Novi Sad",
            "datumRodjenja": "1994-10-22",
            "email": "ppetrovic@webd.com",
            "ime": "Petar",
            "prezime": "Petrovic",
            "lozinka": "petar123",
            "telefon": "062321321",
            "korisnickoIme": "petar"
        },
        "-MNQoCqEXydVTdCNV47C": {
            "id": "-MNQoCqEXydVTdCNV47C",
            "adresa": "Jug Bogdana 14, Zrenjanin",
            "datumRodjenja": "1982-05-05",
            "email": "jjovanovic@webd.com",
            "ime": "Jovana",
            "lozinka": "jovana123",
            "prezime": "Jovanović",
            "telefon": "062321321",
            "korisnickoIme": "jovana"
        },
        "-MNQoJw2p9rci4Rm_rYY": {
            "id": "-MNQoJw2p9rci4Rm_rYY",
            "adresa": "Cara Lazara 9a, Kragujevac",
            "datumRodjenja": "1990-09-17",
            "email": "mmarkovic@webd.com",
            "ime": "Marko",
            "lozinka": "marko123",
            "prezime": "Marković",
            "telefon": "063876876",
            "korisnickoIme": "marko"
        },
        "-MNQoR-5erkWvcm8Hdnk": {
            "id": "-MNQoR-5erkWvcm8Hdnk",
            "adresa": "Solunska 5, Niš",
            "datumRodjenja": "1973-03-10",
            "email": "ffilipovic@webd.com",
            "ime": "Filip",
            "lozinka": "filip123",
            "prezime": "Filipović",
            "telefon": "064159159",
            "korisnickoIme": "filip"
        },
        "-MNQoWt_gDudX5W8TLQj": {
            "id": "-MNQoWt_gDudX5W8TLQj",
            "adresa": "Ružićeva 32, Beograd",
            "datumRodjenja": "1998-06-29",
            "email": "ttijanic@webd.com",
            "ime": "Tijana",
            "lozinka": "tijana123",
            "prezime": "Tijanić",
            "telefon": "065753753",
            "korisnickoIme": "tijana"
        }
    }
}